IDENTIFICATION DIVISION.
PROGRAM-ID. SORT-NUMBERS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 TMP-NUM PIC 9(10).
01 I PIC 9(10).
01 J PIC 9(10).

LINKAGE SECTION.
01 LS-NUMBERS.
       05 NUMBERS-TABLE OCCURS 1000 TIMES INDEXED BY I1.
           10 NUMBER-ENTRY PIC 9(10) VALUE 0.
01 LS-SIZE PIC 9(10).

PROCEDURE DIVISION USING LS-NUMBERS, LS-SIZE.
       *> Stupid bubble sort, but the SORT verb is file based
       PERFORM VARYING I FROM 1 BY 1 UNTIL I > LS-SIZE - 1
           ADD 1 TO I GIVING J
           PERFORM UNTIL J > LS-SIZE - 1
               IF NUMBER-ENTRY(I) > NUMBER-ENTRY(J)
                   MOVE NUMBER-ENTRY(I) TO TMP-NUM
                   MOVE NUMBER-ENTRY(J) TO NUMBER-ENTRY(I)
                   MOVE TMP-NUM TO NUMBER-ENTRY(J)
               END-IF
               ADD 1 TO J
           END-PERFORM
       END-PERFORM

       EXIT PROGRAM.
